{
    "BIND_OPTS": {
        "namespace": "Windows.Win32.Com.BIND_OPTS",
        "comment": "Contains parameters used during a moniker-binding operation."
    },
    "CREATESTRUCT": {
        "namespace": "Windows.Win32.WindowsAndMessaging.CREATESTRUCTW",
        "comment": "Defines the initialization parameters passed to the window procedure of an application. These members are identical to the parameters of the CreateWindowEx function."
    },
    "MONITORINFO": {
        "namespace": "Windows.Win32.Gdi.MONITORINFO",
        "comment": "The MONITORINFO structure contains information about a display monitor."
    },
    "MOUSEMOVEPOINT": {
        "namespace": "Windows.Win32.KeyboardAndMouseInput.MOUSEMOVEPOINT",
        "comment": "Contains information about the mouse's location in screen coordinates."
    },
    "PROCESS_INFORMATION": {
        "namespace": "Windows.Win32.SystemServices.PROCESS_INFORMATION",
        "comment": "Contains information about a newly created process and its primary thread. It is used with the CreateProcess, CreateProcessAsUser, CreateProcessWithLogonW, or CreateProcessWithTokenW function."
    },
    "SECURITY_ATTRIBUTES": {
        "namespace": "Windows.Win32.SystemServices.SECURITY_ATTRIBUTES",
        "comment": "The SECURITY_ATTRIBUTES structure contains the security descriptor for an object and specifies whether the handle retrieved by specifying this structure is inheritable.\n\nThis structure provides security settings for objects created by various functions, such as CreateFile, CreatePipe, CreateProcess, RegCreateKeyEx, or RegSaveKeyEx."
    },
    "SOLE_AUTHENTICATION_SERVICE": {
        "namespace": "Windows.Win32.Com.SOLE_AUTHENTICATION_SERVICE",
        "comment": "Identifies an authentication service that a server is willing to use to communicate to a client."
    },
    "STARTUPINFO": {
        "namespace": "Windows.Win32.SystemServices.STARTUPINFOW",
        "comment": "Specifies the window station, desktop, standard handles, and appearance of the main window for a process at creation time."
    },
    "SYSTEM_POWER_STATUS": {
        "namespace": "Windows.Win32.SystemServices.SYSTEM_POWER_STATUS",
        "comment": "Contains information about the power status of the system."
    },
    "VALENT": {
        "namespace": "Windows.Win32.WindowsProgramming.VALENTW",
        "comment": "Contains information about a registry value. The RegQueryMultipleValues function uses this structure."
    }
}